<!doctype html>
<html lang="ru">
<head>
    <meta charset="UTF-8">
    <meta name="viewport"
          content="width=device-width, user-scalable=no, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0">
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
    <title>TestEng - Публичная оферта</title>

    <link rel="stylesheet" href="./css/main.min.css">
    <link href="https://fonts.googleapis.com/css?family=Roboto:400,500&display=swap" rel="stylesheet">
    <link rel="stylesheet" href="https://stackpath.bootstrapcdn.com/bootstrap/4.3.1/css/bootstrap.min.css"
          integrity="sha384-ggOyR0iXCbMQv3Xipma34MD+dH/1fQ784/j6cY/iJTQUOhcWr7x9JvoRxT2MZw1T" crossorigin="anonymous">
</head>
<body>
<header class="header header_large" style="background-image: url(./img/terms-header.jpg)">
    <div class="container">
        <div class="row">
            <div class="col-6">
                <a href="https://testeng.online/">
                    <img class="header__logo" src="./img/logo.png" alt="testeng logo">
                </a>
            </div>
            <div class="col-6 d-none d-sm-block">
                <div class="block_right">
                    <a class="header__button button button_dark button_radius button_large" href="/test.php">
                        Пройти тест
                    </a>
                </div>
            </div>
        </div>
        <div class="row justify-content-center">
            <div class="header__title text-h1">
                <span>ПУБЛИЧНАЯ ОФЕРТА</span>
            </div>
        </div>
    </div>
</header>

<section class="terms-section">
    <div class="container">
        <div class="row">
            <span class="text-h5">
                1 Термины и определения
            </span>
            <p>
                Термины, не определённые настоящей офертой, используются в значении, придаваемом им действующим законодательством
                и/или исходя из общего смысла и целей оферты.
            </p>
            <p>
                1.1. "Testeng.online" – интернет-платформа, которая являет собой совокупность объектов интеллектуальной собственности.
                Включая, но не ограничиваясь – программное обеспечение, графический дизайн, базы данных, информация в текстовой,
                графической, звуковой или любой другой форме размещенные в доменной зоне
                <a href="https://testeng.online/">https://testeng.online/</a>. В дальнейшем именуется
                "Платформа".
            </p>
            <p>
                1.2. Сторона/Стороны – Администрация Платформы и/или Пользователь.
            </p>
            <p>
                1.3. Администрация – Неделев Филипп Сергеевич. Предложения, вопросы и жалобы Пользователей к Администрации
                следует присылать на адрес <a href="mailto: support@testeng.online">support@testeng.online</a>.
            </p>
            <p>
                1.4. Пользователь – физическое лицо, получившее доступ к Платформе посредством сети Интернет, достигшее
                возраста, допустимого в соответствии с законодательством Украины для акцепта Оферты, и обладающее
                соответствующими полномочиями.
            </p>
            <p>
                1.5. Оферта – настоящее предложение, определяющее права и обязанности сторон по доступу к Платформе и
                порядку пользования Платформой.
            </p>
            <p>
                1.6. Акцепт Оферты – полное и безоговорочное принятие Пользователем условий Оферты.
            </p>
            <p>
                1.7. Имейл Пользователя – указанный в начале использовании Платформы адрес электронной почты Пользователя.
            </p>
            <p>
                1.8. Контент – текстовые, графические, аудиовизуальные или любые другие материалы, разработанные,
                организованные или предоставляемые Платформой и размещенные на Платформе для использования Пользователем.
            </p>

            <span class="text-h5">
                2 Общие положения
            </span>
            <p>
                2.1. В соответствии со статьей 641 Гражданского кодекса Украины настоящая Оферта является официальным
                и публичным предложением Администрации Платформы адресованным Пользователям, заключить договор на
                указанных ниже условиях. Пользователь обязан полностью ознакомиться с настоящей Офертой до момента
                использования Платформы.
            </p>
            <p>
                2.2. Полным и безоговорочным акцептом настоящей Оферты согласно ст. 642 Гражданского кодекса Украины
                является начало использования Пользователем функциональности Платформы.
            </p>
            <p>
                2.3. Акцепт настоящей Оферты означает, что Пользователь согласен со всеми положениями настоящей Оферты
                и обязуется им следовать. С момента Акцепта настоящей Оферты Пользователем данное предложение считается
                договором, заключенным между Администрацией Платформы и Пользователем на условиях, установленных в
                настоящем предложении.
            </p>
            <p>
                2.4. В отношении функционирования и развития Платформы Администрация Платформы руководствуется
                законодательством Украины, настоящей Офертой и иными специальными документами, которые разработаны или
                могут быть разработаны и приняты Администрацией Платформы в целях регламентации предоставления
                Пользователям доступа к функционалу Платформы. Администрация оставляет за собой право изменять или
                дополнять текст документов, принятых ею в любой момент без предварительного или последующего сообщения
                Пользователю об этом. Пользователь самостоятельно отслеживает эти изменения и ознакомляется с действующей
                редакцией. Продолжение использования Платформы Пользователем после внесения изменений или дополнений
                значит принятие и согласие Пользователя на такие изменения или дополнения.
            </p>
            <p>
                2.5. Администрация имеет право отказаться от исполнения своих обязательств за этим Договором
                путем расторжения его досрочно, и при этом освобождается от возмещения Пользователю любых сумм полученных
                от Пользователя как плата за услугу доступа к Платформе за этим Договором, а в случае причинения
                Пользователю расторжением Договора любого ущерба освобождается от его возмещения.
            </p>
            <p>
                2.6. В случае отказа Пользователя от Услуг, Администрация Платформы не возвращает Пользователю денежную
                сумму, поступившую на расчетный счет Администрации Платформы в счёт оплаты за услуги.
            </p>
            <p>
                2.7.Администрация имеет право устанавливать любые ограничения в использовании Платформы.
            </p>

            <span class="text-h5">
                3 Предмет договора и порядок оказания услуг
            </span>
            <p>
                3.1. Администрация Платформы обязуется на условиях, установленных настоящей Офертой, предоставлять
                Пользователю доступ для Просмотра Контента, а Пользователь обязуется надлежащим образом выполнять
                условия, установленные настоящей Офертой.
            </p>
            <p>
                3.2. Пользователь самостоятельно отслеживает изменение реквизитов Администрации Платформы, указанных в
                настоящей Оферте и несет ответственность за правильность производимых им платежей.
            </p>
            <p>
                3.3. Платформа осуществляет надзор за достоверностью и полнотой Контента. В случае выявления
                неточностей Администрация берёт на себя обязательство в кратчайшие сроки рассмотреть замечания
                насчёт Контента. Пользователь соглашается, что выявление неточностей и ошибок в Контенте на Платформе
                не влияет на качество услуги доступа к Контенту на Платформе и не является основанием для возвращения
                денежных средств за услуги Платформы или уменьшение их стоимости.
            </p>
            <p>
                3.4. Администрация имеет право по собственной инициативе прекращать и/или ограничивать доступ
                Пользователя ко всем или к любому из сервисов Платформы.
            </p>
            <p>
                4.5. Пользователь соглашается с тем, что действия, совершённые им на Платформе после ввода Имейла
                Пользователя, признаются действиями Пользователя.
            </p>
            <p>
                4.6. Вводя Имейл Пользователя на Платформе, Пользователь даёт согласие на получение информационных
                сообщений на указанный при регистрации адрес электронной почты.
            </p>

            <span class="text-h5">
                4 Использование контента на платформе
            </span>
            <p>
                4.1. Платформа вмещает Контент, услуга доступа к которому предоставляется бесплатно.
            </p>
            <p>
                4.2. Использование Контента на Платформе Пользователем совершается на таких условиях:
            </p>
            <p>
                4.2.1. Пользователю разрешается использовать Контент только для личного некоммерческого использования.
            </p>
            <p>
                4.2.2. Пользователю запрещается копировать, сохранять и записывать на диск или любой другой носитель
                информации Контент, а также запрещается распространять Контент в сети Интернет.
            </p>
            <p>
                4.2.3. Пользователю запрещается предоставлять доступ к Контенту третьим лицам.
            </p>
            <p>
                4.2.4. Пользователю запрещается совершать любые действия, которые мешают нормальному функционированию Платформы.
            </p>
            <p>
                4.2.5. Пользователь не должен нарушать, блокировать или любым другим способом приносить вред любым
                средствам безопасности Платформы, а также средствам, которые предотвращают или ограничивают использование
                или копирование Контента размещенного на Платформе.
            </p>

            <span class="text-h5">
                5 Персональные данные
            </span>
            <p>
                5.1. Акцептуя настоящую Оферту, Пользователь предоставляет своё согласие на обработку своих персональных
                данных как без использования средств автоматизации, так и с их использованием.
            </p>
            <p>
                5.2. Пользователь, размещая данные на Платформе, выражает свое согласие на обработку персональных
                данных Администрацией Платформы и/или третьим лицом, которому Администрацией Платформы поручена
                обработка указанных персональных исключительно в целях оказания Услуг.
            </p>
            <p>
                5.3. Пользователь, используя Платформу, гарантирует, что в случаях, предусмотренных законом, у него
                есть предварительно полученное письменное согласие своего родителя/законного представителя на обработку
                его персональных данных Администрацией Платформы и/или третьими лицами.
            </p>
            <p>
                5.4. Персональные данные не являются общедоступными.
            </p>
            <p>
                5.5. Основанием для обработки персональных данных является ст. 32 Конституции Украины, закон Украины
                "Про захист персональних даних" и настоящая оферта.
            </p>
            <p>
                5.6. Обработка персональных данных Пользователя осуществляется Администрацией Платформы до момента
                исполнения Сторонами своих обязательств.
            </p>

            <span class="text-h5">
                6 Интеллектуальная собственность
            </span>
            <p>
                6.1. Все материалы, представленные на Платформе, включая изображения, программный код, логотипы,
                графику, звуки являются объектами исключительных прав и защищены в соответствии с законодательством
                Украины об интеллектуальной собственности.
            </p>
            <p>
                6.2. Администрация Платформы оставляет за собой исключительные прав интеллектуальной собственности на
                Контент, что ей принадлежит, включая право препятствовать или запрещать незаконное использование
                Контента третьими лицами.
            </p>
            <p>
                6.3. При использовании Платформы запрещена загрузка, передача между Пользователями, изменение или
                размещение информации, данных или изображений, которые нарушают исключительные права третьих лиц,
                в частности авторские и смежные с ними права, а также исключительные права на изобретение, полезную
                модель, промышленный образец или товарный знак. В случаи их нарушения Пользователь несет ответственность.
            </p>
            <p>
                6.4. В случае наличия обоснованных подозрений о нарушение прав интеллектуальной собственности третьих
                лиц материалами, которые размещены в Контенте, Администрация сохраняет за собой право прекратить доступ
                к таким материалам через Платформу без предварительного или со следующим сообщением Пользователя и не
                несет ответственности за внесение таких изменений.
            </p>

            <span class="text-h5">
                7 Заключительные положения
            </span>
            <p>
                7.1. Правовые отношения, возникающие в связи с настоящей Офертой, регулируются законодательством Украины.
            </p>
            <p>
                7.2. По вопросам, не урегулированным настоящей Офертой, Стороны руководствуются действующим
                законодательством Украины.
            </p>
            <p>
                7.3. Администрация Платформы освобождается от ответственности за нарушение условий настоящей Оферты,
                если такое нарушение вызвано действием обстоятельств непреодолимой силы (форс-мажор).
            </p>
            <p>
                7.4. Администрация Платформы не несёт ответственности в случае финансовых или иных потерь Пользователей,
                вызванных временной неработоспособностью Платформы по следующим причинам: плановые или внеплановые
                технические и профилактические работы, технические сбои интернет — провайдеров, компьютерных сетей,
                серверов и средств, а также противоправные действия третьих лиц умышленные, неумышленные
                (в том числе неосторожные) действия самого Пользователя и/или форс-мажорные обстоятельства.
                При этом Администрация Платформы берёт на себя обязательство приложить максимум усилии для восстановления
                работоспособности Платформы в кратчайшие сроки.
            </p>
            <p>
                7.5. Администрация Платформы не несёт ответственности за нарушение интеллектуальных прав третьих лиц,
                если такое нарушение было вызвано действиями Пользователя.
            </p>

            <span class="text-h5">
                8 Срок действия оферты
            </span>
            <p>
                8.1. Настоящая Оферта вступает в силу с момента совершения Пользователем Акцепта Оферты и
                действует до полного выполнения своих обязательств Сторонами.
            </p>
            <p>
                8.2. Пользователь соглашается, что внесение изменений в настоящую Оферту может производиться
                Администрацией Платформы в одностороннем порядке без предварительного согласования с Пользователем.
            </p>
        </div>
    </div>
</section>



<?php
include_once("footer.php")
?>
</body>
</html>