
var dataTexts = [
    {
        title: 'Reading',
        text: 'Часть Reading позволяет понять, на сколько хорошо вы понимаете тексты на английском языке. ' +
        'Вам необходимо прочитать текст и ответить на тестовые вопросы за 15 минут.' +
        ' Переключатся между вопросами можно при помощи кнопок. После того, как вы ответили на все вопросы, нажмите кнопку Далее.' +
        ' В случае если время закончится, тест автоматически перейдет к следующему разделу.',
        button: 'Перейти к Reading'
    },
    {
        title: 'Listening',
        text: 'Часть Listening позволяет понять, на сколько хорошо вы понимаете лекции и разговорную речь на английском' +
        ' языке. Вам необходимо прослушать аудиозапись и ответить на тестовые вопросы. На прохождение данного раздела вам' +
        ' дано 10 минут. Переключатся между вопросами можно при помощи кнопок. После того как вы ответили на все вопросы,' +
        ' нажмите кнопку Далее. В случае если время закончится, тест автоматически перейдет к следующему разделу.'
    },
    {
        title: 'Speaking',
        text: 'Раздел Speaking позволит оценить вашу устную речь. Вам будет дано задание с темой и 5 минуты на' +
        ' подготовку и запись голоса. Для того, чтобы наши менторы смогли полноценного оценить ваш навык говорения,' +
        ' мы рекомендуем сделать запись не менее 3 минут. Вы можете начать запись, нажав кнопку со значком микрофона.' +
        ' Нажав ее повторно вы остановите запись. Запись голоса будет отправлена на ' +
        'проверку по истечении времени или по нажатии на кнопку Далее.',
        button: 'Перейти к Speaking'
    },
    {
        title: 'Writing',
        text: 'Раздел Writing позволит оценить ваш навык письма. Вам нужно будет составить и написать эссе' +
        ' на академическую тематику. На выполнение задания вам будет дано 30 минут. Для качественной проверки' +
        ' ваших навыков, мы рекомендуем написать не менее 150-200 слов. Для завершения теста нажмите кнопку Далее.'
    },
    {
        title: 'Results'
    },
    {
        title: 'Payment'
    }
];